{
  "id": 129797,
  "cover": "//images.igdb.com/igdb/image/upload/t_thumb/co1yrq.jpg",
  "first_release_date": 1007078400,
  "game_modes": [
    1,
    2,
    3
  ],
  "genres": [
    "Point-and-click",
    "Real Time Strategy (RTS)",
    "Strategy"
  ],
  "involved_companies": [
    123725,
    123727,
    251921,
    251922
  ],
  "name": "Age of Empires II: Gold Edition",
  "platforms": [
    6,
    14
  ],
  "screenshots": [
    430595,
    430596,
    430597,
    430598,
    430599,
    430600,
    430601,
    430602,
    430603,
    430604,
    430605,
    430606
  ],
  "slug": "age-of-empires-ii-gold-edition",
  "storyline": "Age of Empires II is a real-time strategy game that focuses on building towns, gathering resources, and creating armies to defeat opponents. Players conquer rival towns and empires as they advance one of 13 civilizations through four \"Ages\": the Dark Age, the Feudal Age, the Castle Age (being the High Middle Ages), and the Imperial Age, reminiscent of the Renaissance—a 1000-year timeframe. Advancing to a new Age unlocks new units, structures, and technologies, but players must first build certain buildings from their current age and then pay a sum of resources (typically food and gold).",
  "summary": "Age of Empires II Gold Edition unites the exciting game play of both Microsoft Age of Empires II: The Age of Kings and Age of Empires II: The Conquerors Expansion - plus additional content - for one compelling gaming experience. Age of Empires II: The Age of Kings spans 1,000 years, from the fall of Rome through the Middle Ages, in which players control the destiny of one of thirteen civilizations. Age of Empires II: The Conquerors Expansion will challenge veterans and novices to wage war on an epic scale with all-new civilizations, unique units and technologies, and campaigns based on infamous conquerors such as Attila the Hun, El Cid and Montezuma.\n\nAge of Empires 2 Gold Edition unites the exciting game play of both Age of Empires 2: The Age of Kings and Age of Empires2: The Conquerors Expansion plus additional content for one compelling gaming experience. Experience real-time evolution as you build your civilization into a flourishing empire, from the Dark Age to the Imperial Age. Decide whether to conquer the world through military might, commerce and diplomacy, or intrigue and regicide. There are many paths to power but only one will reign supreme. Age of Empires 2: The Age of Kings spans 1,000 years, from the fall of Rome through the Middle Ages. Players control the destiny of one of 13 civilizations. The game keeps the epic scope of Age of Empires' gameplay while evolving the combat and economic features. Developed by Ensemble Studios, Age of Empires 2features the expertise of Bruce Shelley, co designer of Age of Empires and the hit strategy game Civilization. Age of Empires 2: The Conquerors Expansion adds five new civilizations, four new campaigns, 11 new units, 26 new technologies, real world maps, and much more. Experience the adventure of the Spanish Conquistadors as they enter the exotic lands of the Aztecs, or relive the destructive force of Attila's pillaging Huns. This add-on pack focuses on the armies and military thinking of a handful of history's greatest tacticians, including Attila the Hun, El Cid, and Montezuma. The new civilizations each have unique attributes, buildings, and technologies, such as Chinese Rocketry and Persian Mahouts. You'll put hussar cavalry, kamikaze siege units, and halberdier infantry into battle in four all-new campaigns. Play up to eight other conquerors via modem, Internet, or LAN.",
  "themes": [
    22,
    39
  ],
  "total_rating": 88.75066541434913,
  "url": "https://www.igdb.com/games/age-of-empires-ii-gold-edition",
  "videos": [
    47648,
    47649
  ],
  "websites": [
    176573,
    176574,
    176575,
    176576,
    176577,
    176578,
    176579,
    176580
  ]
}